{
  "architectures": [
    "MobileBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "B-ACCOUNT",
    "1": "B-DATE",
    "2": "B-DEVICE",
    "3": "B-EMAIL",
    "4": "B-FAX",
    "5": "B-HEALTHPLAN",
    "6": "B-ID",
    "7": "B-IP",
    "8": "B-LICENSE",
    "9": "B-LOCATION",
    "10": "B-MRN",
    "11": "B-NAME",
    "12": "B-PHONE",
    "13": "B-SSN",
    "14": "B-URL",
    "15": "B-VEHICLE",
    "16": "I-ACCOUNT",
    "17": "I-DATE",
    "18": "I-DEVICE",
    "19": "I-EMAIL",
    "20": "I-FAX",
    "21": "I-HEALTHPLAN",
    "22": "I-ID",
    "23": "I-IP",
    "24": "I-LICENSE",
    "25": "I-LOCATION",
    "26": "I-MRN",
    "27": "I-NAME",
    "28": "I-PHONE",
    "29": "I-SSN",
    "30": "I-URL",
    "31": "I-VEHICLE",
    "32": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "B-ACCOUNT": 0,
    "B-DATE": 1,
    "B-DEVICE": 2,
    "B-EMAIL": 3,
    "B-FAX": 4,
    "B-HEALTHPLAN": 5,
    "B-ID": 6,
    "B-IP": 7,
    "B-LICENSE": 8,
    "B-LOCATION": 9,
    "B-MRN": 10,
    "B-NAME": 11,
    "B-PHONE": 12,
    "B-SSN": 13,
    "B-URL": 14,
    "B-VEHICLE": 15,
    "I-ACCOUNT": 16,
    "I-DATE": 17,
    "I-DEVICE": 19,
    "I-EMAIL": 20,
    "I-FAX": 21,
    "I-HEALTHPLAN": 22,
    "I-ID": 23,
    "I-IP": 24,
    "I-LICENSE": 25,
    "I-LOCATION": 26,
    "I-MRN": 27,
    "I-NAME": 28,
    "I-PHONE": 29,
    "I-SSN": 30,
    "I-URL": 31,
    "I-VEHICLE": 32,
    "O": 33
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "transformers_version": "4.57.0",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "vocab_size": 30522
}
